       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A PIC 9(3) VALUE 10.
       01 B PIC 9(3) VALUE 20.
       01 TOTAL PIC 9(3).
       PROCEDURE DIVISION.
           ADD A TO B GIVING TOTAL.
           DISPLAY TOTAL.
           STOP RUN.
