       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY COMMON.
       PROCEDURE DIVISION.
           DISPLAY 'MAIN'.
           CALL "UTILS".
           STOP RUN.
