       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN-WITH-COPY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY COMMON.
       PROCEDURE DIVISION.
           DISPLAY 'MAIN'.
           STOP RUN.
