       IDENTIFICATION DIVISION.
       PROGRAM-ID. UTILS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 UTIL-MSG PIC X(20) VALUE 'UTIL READY'.
       PROCEDURE DIVISION.
           DISPLAY UTIL-MSG.
           STOP RUN.
