       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY COMMON.
       LINKAGE SECTION.
       01  MAIN-INPUT PIC 9(4).
       PROCEDURE DIVISION USING MAIN-INPUT.
           MOVE "S" TO WS-STATUS
           MOVE MAIN-INPUT TO WS-AMOUNT
           CALL "PRICE" USING MAIN-INPUT
           GOBACK.

