       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRICE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  BASE-PRICE PIC 9(4) VALUE 100.
       01  FINAL-PRICE PIC 9(4).
       PROCEDURE DIVISION.
           ADD 25 TO BASE-PRICE GIVING FINAL-PRICE
           GOBACK.

